#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.vpc_subnet_module.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03aba3723f9835a25]
module.vpc_subnet_module.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0419ba9a4a4b72364]
module.vpc_subnet_module.aws_vpc.this[0]: Refreshing state... [id=vpc-0504b20795b36901c]
module.vpc_subnet_module.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04685f5acf584a1e9]
module.vpc_subnet_module.aws_subnet.public[2]: Refreshing state... [id=subnet-0e7217920d362ec6c]
module.vpc_subnet_module.aws_route_table.private[2]: Refreshing state... [id=rtb-021c4be79640c9cff]
module.vpc_subnet_module.aws_route_table.private[1]: Refreshing state... [id=rtb-0a2ad4275ccc8f570]
module.vpc_subnet_module.aws_route_table.private[0]: Refreshing state... [id=rtb-053ae5d05b2fe095b]
module.vpc_subnet_module.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6b11bfd9ef1ff3a]
module.vpc_subnet_module.aws_subnet.public[1]: Refreshing state... [id=subnet-04de5cebdbb70256f]
module.vpc_subnet_module.aws_subnet.private[2]: Refreshing state... [id=subnet-0bfcb69e31055a212]
module.vpc_subnet_module.aws_subnet.private[1]: Refreshing state... [id=subnet-06f7d1b84c6ac9acb]
module.vpc_subnet_module.aws_subnet.private[0]: Refreshing state... [id=subnet-0b33cf62ea358d136]
module.vpc_subnet_module.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f6c01ca0c97f5fd7]
module.vpc_subnet_module.aws_route_table.public[0]: Refreshing state... [id=rtb-02bb84ed651881d9d]
module.vpc_subnet_module.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03da667daf612852e]
module.vpc_subnet_module.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-023a738f2d4787fce]
module.vpc_subnet_module.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0804486adb345a212]
module.vpc_subnet_module.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09e2b1b0fdcaa7293]
module.vpc_subnet_module.aws_nat_gateway.this[2]: Refreshing state... [id=nat-087464bd187267a52]
module.vpc_subnet_module.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07201d99c7049b327]
module.vpc_subnet_module.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-023695873340a563c]
module.vpc_subnet_module.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0620de718b62ecdfb]
module.vpc_subnet_module.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0242b9d6abda94d1e]
module.vpc_subnet_module.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02bb84ed651881d9d1080289494]
module.vpc_subnet_module.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-021c4be79640c9cff1080289494]
module.vpc_subnet_module.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-053ae5d05b2fe095b1080289494]
module.vpc_subnet_module.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a2ad4275ccc8f5701080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_security_group.egress_all: Refreshing state... [id=sg-00860b45520ac1c37]
aws_security_group.http: Refreshing state... [id=sg-0fe36a13bd9d14983]
aws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:loadbalancer/app/ghost-alb/d96cdba1c841b84f]
aws_efs_file_system.mysql_ecs: Refreshing state... [id=fs-0edca0619a007348f]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_efs_access_point.access_point: Refreshing state... [id=fsap-01eb6f3f8a9aa5f5d]
aws_efs_mount_target.alpha: Refreshing state... [id=fsmt-0e9a6b597fbc6c6db]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.ecs_task_execution_role.data.aws_iam_policy.iam_policy: Reading...
aws_lb_target_group.ghost_api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:targetgroup/ghost-api/f35eb27f92175fe2]
module.ecs_autoscale_role.data.aws_iam_policy_document.iam_policy_document: Reading...
aws_security_group.ingress_api: Refreshing state... [id=sg-081d20e484035bb69]
module.ecs_autoscale_role.data.aws_iam_policy.iam_policy: Reading...
module.ecs_task_execution_role.data.aws_iam_policy_document.iam_policy_document: Reading...
module.ecs_autoscale_role.data.aws_iam_policy_document.iam_policy_document: Read complete after 0s [id=3468681342]
module.ecs_autoscale_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-scale-application]
module.ecs_task_execution_role.data.aws_iam_policy_document.iam_policy_document: Read complete after 0s [id=320642683]
module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=task-execution-role]
aws_alb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:listener/app/ghost-alb/d96cdba1c841b84f/ce3397ea6fff4617]
aws_ecs_task_definition.ecs_task: Refreshing state... [id=mysql]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-1:686430137309:service/ecs-cluster/ecs_service]
aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster/ecs_service]
aws_appautoscaling_policy.appautoscaling_policy_memory: Refreshing state... [id=application-scale-policy-memory]
aws_appautoscaling_policy.appautoscaling_policy_cpu: Refreshing state... [id=application-scale-policy-cpu]
module.ecs_task_execution_role.data.aws_iam_policy.iam_policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.iam_role_policy_attachment: Refreshing state... [id=task-execution-role-20221228180247128800000001]
module.ecs_autoscale_role.data.aws_iam_policy.iam_policy: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole]
module.ecs_autoscale_role.aws_iam_role_policy_attachment.iam_role_policy_attachment: Refreshing state... [id=ecs-scale-application-20221228180247148200000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_ecs_service.ecs_service has been deleted
  - resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-1:686430137309:service/ecs-cluster/ecs_service"
      - name                               = "ecs_service" -> null
        tags                               = {}
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster/ecs_service"
      ~ role_arn           = "arn:aws:iam::686430137309:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::686430137309:role/ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ecs_service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00860b45520ac1c37",
              + "sg-081d20e484035bb69",
            ]
          + subnets          = [
              + "subnet-06f7d1b84c6ac9acb",
              + "subnet-0b33cf62ea358d136",
              + "subnet-0bfcb69e31055a212",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:686430137309:task-definition/mysql:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name         = "mysql"
                  ~ portMappings = [
                      ~ {
                          - hostPort      = 3306 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom  = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "mysql" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "service-storage" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0edca0619a007348f" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2999 -> null

              - authorization_config {
                  - access_point_id = "fsap-01eb6f3f8a9aa5f5d" -> null
                  - iam             = "DISABLED" -> null
                }
            }
        }
      + volume { # forces replacement
          + name = "service-storage"

          + efs_volume_configuration {
              + file_system_id          = "fs-0edca0619a007348f"
              + root_directory          = "/opt/data"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2999

              + authorization_config {
                  + access_point_id = "fsap-01eb6f3f8a9aa5f5d"
                  + iam             = "DISABLED"
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @fhgrings, Action: `pull_request`*